/* La máscara oni en píxeles: la usan la pantalla de carga, el login y el escritorio. */

// 2 sombra · 3 medio tono · 4 luz · 5 ojos (la máscara de frente, la primera versión)
export const RAW = [
  '               2                3               ',
  '               42              22               ',
  '                2              2                ',
  '                2              2                ',
  '                22            22                ',
  '                22            22                ',
  '                232          222                ',
  '                222          222                ',
  '                222  333333  223                ',
  '                2222 322223 2222                ',
  '                2223433222342222                ',
  '                2223443222443322                ',
  '                3334443333444424                ',
  '               444444433224444444               ',
  '               334444333324444433               ',
  '               332444422224444333               ',
  '               332444432334444233               ',
  '               323444433344443233               ',
  '               223545442244445232               ',
  '               233555524425555232               ',
  '               332335434433533333               ',
  '               323322244443222333               ',
  '               342232244442232343               ',
  '                3432234444422334                ',
  '                 32324444443333                 ',
  '                2333244444423333                ',
  '                 33234344344223                 ',
  '                 33334433343223                 ',
  '                 33333    22223                 ',
  '                  322322232223                  ',
  '                   33  32  43                   ',
  '                   3343234433                   ',
  '                   3333433433                   ',
  '                    33424432                    ',
  '                     232233                     ',
];
const L = Math.min(...RAW.map((r) => r.search(/\S/))) - 1;
const R = Math.max(...RAW.map((r) => r.trimEnd().length)) + 1;
export const MASK = RAW.map((r) => r.slice(L, R));
export const COLS = R - L;
export const ROWS = MASK.length;
